# Parameter Filter Rule Factory Create Greater Or Equal Rule Method

Source: https://www.revitapidocs.com/2026/14d42cfa-d1e6-d955-f2d6-6cabd71679c0.htm

---

| Parameter Filter Rule Factory Create Greater Or Equal Rule Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateGreaterOrEqualRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document are greater than or equal to a certain value. |
|  | CreateGreaterOrEqualRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document are greater than or equal to a certain value. |
|  | CreateGreaterOrEqualRule(ElementId, String) | Creates a filter rule that determines whether strings from the document  are greater than or equal to a certain value. |
|  | CreateGreaterOrEqualRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document are greater than or equal to a certain value. |

Top See Also

#### Reference

ParameterFilterRuleFactory Class Autodesk.Revit.DB Namespace